---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainGridFaceCannotBeReparamForGridRotation
source: html/15c228bb-051f-9f3c-216b-dc8826b578b4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainGridFaceCannotBeReparamForGridRotation Property

Curtain grids cannot be rotated exactly as requested. Push "Adjust Grids" to get the nearest valid rotation.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainGridFaceCannotBeReparamForGridRotation { get; }
```